configuration/DataProcessors/ЗагрузкаCSVФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаCSVФайла</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

configuration/Enums/Статус.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Статус</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квалифицированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Роль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

configuration/DataProcessors/ЗагрузкаCSVФайла/Forms/ЗагрузкаCSVФайла/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите нужный файл";
	Фильтр = "Текстовый документ (*.csv)|*.csv";
	Проводник.Фильтр = Фильтр;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте

Процедура ПослеВыбораФайла (ВыбранныеФайлы, ДополнительныеПараметры)Экспорт
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ПутьКФайлу = ВыбранныеФайлы[0];
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере()
	ПоследовательноеЧтение = Истина;
	
	Если ПоследовательноеЧтение Тогда
		Текст = Новый ЧтениеТекста;
		Текст.Открыть(Объект.ПутьКФайлу, КодировкаТекста.UTF8);
		Текст.ПрочитатьСтроку();
		ТекСтрока = Текст.ПрочитатьСтроку();
		
		Пока ТекСтрока <> Неопределено Цикл 
			МассивСлов = СтрРазделить(ТекСтрока, ",");
			Если МассивСлов.Количество() = 10 Тогда
				СправочникЗапись = Справочники.Лиды.СоздатьЭлемент();
				СправочникЗапись.Код = МассивСлов[0];
				СправочникЗапись.Имя = МассивСлов[1];
				СправочникЗапись.Фамилия = МассивСлов[2];
				СправочникЗапись.Телефон = МассивСлов[3];
				СправочникЗапись.Почта = МассивСлов[4];
				
				МассивСлов[5] = ОпределениеСтатуса(МассивСлов[5]);
				
				СправочникЗапись.Статус = МассивСлов[5];
				
				МассивСлов[6] = ОпределениеИсточника(МассивСлов[6]);
				СправочникЗапись.Источник = МассивСлов[6];
				
				МассивСлов[7] = ОпределениеМенеджера(МассивСлов[7]);
				СправочникЗапись.Менеджер = МассивСлов[7];
				
				МассивСлов[8] = ИзменениеДаты(МассивСлов[8]);
				
				СправочникЗапись.Создан = Дата(МассивСлов[8]);
				
				МассивСлов[9] = ИзменениеДаты(МассивСлов[9]);
				
				СправочникЗапись.ПопалВСтатус = Дата(МассивСлов[9]);
				СправочникЗапись.Записать();
			Иначе
				Сообщить("Должно быть 10 значений");
				Возврат;
			КонецЕсли;
			ТекСтрока = Текст.ПрочитатьСтроку();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ОпределениеМенеджера(МенеджерИд)
	ПоискМенеджера = Справочники.Пользователи.НайтиПоКоду(МенеджерИд);
	Если ПоискМенеджера.Пустая() тогда
		ЗаписьМенеджера = Справочники.Пользователи.СоздатьЭлемент();
		ЗаписьМенеджера.Код = МенеджерИд;
		ЗаписьМенеджера.Записать();
		ПоискМенеджера = Справочники.Пользователи.НайтиПоКоду(МенеджерИд);
	КонецЕсли;
	Возврат ПоискМенеджера;
КонецФункции

Функция ОпределениеИсточника(ИсточникИд)
	ПоискИсточника = Справочники.Источник.НайтиПоКоду(ИсточникИд);
	Если ПоискИсточника.Пустая() тогда
		ЗаписьИсточника = Справочники.Источник.СоздатьЭлемент();
		ЗаписьИсточника.Код = ИсточникИд; 
		ЗаписьИсточника.Записать();
		ПоискИсточника = Справочники.Источник.НайтиПоКоду(ИсточникИд);
	КонецЕсли;
	Возврат ПоискИсточника;
КонецФункции

Функция ОпределениеСтатуса(Статус)
	Статус = СтрЗаменить(Статус, " ", "");
	Если Статус = "new" тогда
		Статус = Перечисления.Статус.Новый
	ИначеЕсли Статус = "qualified" Тогда
		Статус = Перечисления.Статус.Квалифицированный;
	ИначеЕсли Статус = "proposal" тогда
		Статус = Перечисления.Статус.Предложение;
	ИначеЕсли Статус = "won" Тогда 
		Статус = Перечисления.Статус.Успешно;
	ИначеЕсли Статус = "lost" Тогда
		Статус = Перечисления.Статус.Отказ;
	КонецЕсли;
	Возврат Статус;
КонецФункции

Функция ИзменениеДаты (Дата1)
	Дата1 = СтрЗаменить(Дата1, " ", "");
	Если Дата1 = "null" тогда
		Дата1 = Дата(1, 1, 1);
	Иначе
		Дата1 = СтрЗаменить(Дата1, "-", "");
		Дата1 = СтрЗаменить(Дата1, ":", "");
		Дата1 = СтрЗаменить(Дата1, "T", "");
		Дата1 = СтрЗаменить(Дата1, "Z", "");
	КонецЕсли;
	Возврат Дата1;
	
КонецФункции

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ПрочитатьФайлНаСервере();
КонецПроцедуры
